000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ADD-EXAMPLE.

000030 DATA DIVISION.
000040 WORKING-STORAGE SECTION.
       *> 01ÇÕÉåÉxÉãÅAPIC (Picture) ëÆê´ÅANUM1ïœêîÅA9(3)ÇÕÇOÇ©ÇÁÇXÇ‹Ç≈ÇÃ3åÖêîéöÅAêîéöÇÕÇPÇOÇO
000050 01 NUM1 PIC 9(3) VALUE 100.
000060 01 NUM2 PIC 9(3) VALUE 200.
       *> RESULTïœêîåvéZÇ≥ÇÍÇ‹Ç∑
000070 01 RESULT PIC 9(3).

000080 PROCEDURE DIVISION.
000090 MAIN-LOGIC.
000100     DISPLAY "Num1: " NUM1.
000110     DISPLAY "Num2: " NUM2.

000120     ADD NUM1, NUM2 GIVING RESULT.

000130     DISPLAY "Result: " RESULT.

000140     STOP RUN.
